system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    combined
    {
        type triSurfaceMesh;
        file "combined.stl";

        regions
        {
            ofen_walls     { name ofen_walls;     }
            glass     	{ name glass;     }
            keksen     	{ name keksen;     }
            hot_wall     	{ name hot_wall;     }
            trays     	{ name trays;     }
            fan     	{ name fan;     }
            
                  
        }
    }
    
	rotatingZone
	{
		type	searchableCylinder;
		point1	(0.0 0.109944 0.07502);
		point2	(0.0 0.139944 0.07502);
		radius	0.04; //0.067263
	}
};

castellatedMeshControls
{
    refinementSurfaces
    {
        combined
        {
            level (0 0);
            regions
            {
                ofen_walls     { level (1 1); patchInfo { type wall; } }
                glass    { level (1 1); patchInfo { type wall; } }
                keksen    { level (3 3); patchInfo { type wall; } }
                hot_wall    { level (1 1); patchInfo { type wall; } }
                trays    { level (2 2); patchInfo { type wall; } }
                fan    { level (4 5); patchInfo { type wall; } }
               
                //sag_patch    { level (1 1); patchInfo { type patch; } }
                //sol_patch    { level (1 1); patchInfo { type patch; } }
               
            }
        }
        
        rotatingZone
        {
            level (3 3); // Note: better: levels 3 3
            //faceType boundary;
            cellZone rotatingZone;
            faceZone rotatingZone;
            cellZoneInside inside;
        }
        
        

 }

    nCellsBetweenLevels 3;
    resolveFeatureAngle	20;

    refinementRegions
    {
	    	combined
		{
			mode inside;
			levels	((1e5 1));
		}
     }
	locationInMesh (0.0 0.0 0.01);
	allowFreeStandingZoneFaces	false;
}
snapControls
{
    implicitFeatureSnap true;
    explicitFeatureSnap false;
    
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 3; //5
    
    
    nFeatureSnapIter 10;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 1.0;

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 30; //30

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 5; //5
}

addLayersControls
{
    relativeSizes       true;
    minThickness        1;
    finalLayerThickness 1;
    expansionRatio      1;
    layers
    {}
}

// ************************************************************************* //
