0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ofen_walls
    {
        type            noSlip;
    }

    keksen
    {
        type            noSlip;
    }

    trays
    {
        type            noSlip;
    }
    
    hot_wall
   {
    	type            noSlip;
   }
   
   fan
   {
    	type            noSlip;
   }
   
   glass
   {
    	type            noSlip;
   }
}


// ************************************************************************* //
