0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
	#includeEtc "caseDicts/setConstraintTypes"
    ofen_walls
    {
        type            calculated;
        value           $internalField;
    }

    keksen
    {
        type            calculated;
        value           $internalField;
    }

    hot_wall
    {
        type            calculated;
        value           $internalField;
    }
    
    glass
    {
        type            calculated;
        value           $internalField;
    }
    
    trays
    {
        type            calculated;
        value           $internalField;
    }

    fan
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
