0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 453;

boundaryField
{
    ofen_walls
    {
        type            fixedValue;
        value           uniform 373;
    }

keksen
{
    type            externalWallHeatFluxTemperature;	//externalWallHeatFluxTemperature	lumpedMassWallTemperature
    mode            coefficient;
    kappaMethod     fluidThermo;
    //kappa	    none;
    thicknessLayers (0.03);
    kappaLayers     (0.07);
    h		    uniform 0.5;
    Ta              $internalField;
    /*mass	    1;
    Cp		    2100;*/	//(J/kg.K)	
    value	    uniform 300;
}

    hot_wall
{
    type            fixedValue;
    value           uniform 473;
}

glass
{
    type            fixedValue;
        value           uniform 373;
}

trays
{
    type            fixedValue;
        value           uniform 373;
}

fan
{
    type            fixedValue;
        value           uniform 373;
}


}


// ************************************************************************* //
