0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    ofen_walls
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    keksen
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    hot_wall
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    trays
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    
    glass
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    
    fan
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
}


// ************************************************************************* //
