0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    ofen_walls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    hot_wall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

keksen
{
    type            nutkWallFunction;
        value           uniform 0;
}

trays
{
    type            nutkWallFunction;
        value           uniform 0;
}

glass
{
    type            nutkWallFunction;
        value           uniform 0;
}

fan
{
    type            nutkWallFunction;
        value           uniform 0;
}


}


// ************************************************************************* //
