system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict.cfg;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
ofen_walls.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       150;

    // Write options
    writeFeatureEdgeMesh    yes;
    writeObj		    yes;
}

trays.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       150;

    // Write options
    writeFeatureEdgeMesh    yes;
    writeObj		    yes;
}

keksen.stl
{
    extractionMethod    extractFromSurface;

    includedAngle       150;

    // Write options
    writeFeatureEdgeMesh    yes;
    writeObj		    yes;
}


// ************************************************************************* //
